astb_relise/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <comment>Номенклатура для выдачи</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСинхронизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАнтропометрическогоСвойства</name>
    <type>
      <types>CatalogRef.ВидыАнтропометрическихСвойств</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьВидАнтропометрическогоСвойстваПриАнализе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРост</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСИЗ</name>
    <type>
      <types>CatalogRef.ВидыСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесДляУчетаЧистки</name>
    <comment>Вес для учета чистки (химчистки) СИЗ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьКакКомплектВЗаказеПоставщикуИОтчетеДляСАП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьШтрихкод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоеКоличествоЦикловЧистки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРазмеровМеньше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРазмеровБольше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможнаАвтоматизированнаяВыдача</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматизированнаяВыдачаБезОшибок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьПриФормированииЗаказовПоставщику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриниматьНаХранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСбыта</name>
    <type>
      <types>EnumRef.СтатусыСбыта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчетаКомплектаДляППС</name>
    <type>
      <types>EnumRef.ВидыУчетаКомплектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаркированнойНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыМаркированнойНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаХранения</name>
    <type>
      <types>CatalogRef.ТочкиХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодлежитУтилизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НавигационнаяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейтинг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяДляПримеркиВTexel</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРоста</name>
    <type>
      <types>CatalogRef.ВидыАнтропометрическихСвойств</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГОСТы</name>
    <attributes>
      <name>ГОСТ</name>
      <type>
        <types>CatalogRef.ГОСТы</types>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сертификаты</name>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

astb_relise/src/Catalogs/Номенклатура/Forms/ФормаВыбора/Module.bsl
&НаКлиенте
Процедура ИерархияПриАктивизацииСтроки(Элемент)
	
	Если ЭтаФорма.Элементы.Иерархия.ТекущаяСтрока = Неопределено Тогда
		ТекущаяИерархия = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Родитель", ТекущаяИерархия,ВидСравненияКомпоновкиДанных.Равно, "Родитель", Истина);
	Иначе
		Если ЗначениеЗаполнено(ЭтаФорма.Элементы.Иерархия.ТекущаяСтрока) Тогда
			ТекущаяИерархия = ЭтаФорма.Элементы.Иерархия.ТекущаяСтрока;
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Родитель", ТекущаяИерархия,ВидСравненияКомпоновкиДанных.Равно, "Родитель", Истина);
		Иначе
			ТекущаяИерархия = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Родитель", ТекущаяИерархия,ВидСравненияКомпоновкиДанных.Равно, "Родитель", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	ЭтаФорма.ТекущаяИерархия = ТекущаяИерархия; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	СохранитьНастройкиФормыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиФормыНаСервере()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Справочник_НоменклатураВыдачи_ФормаВыбора","ФормаВыбора" , Новый Структура("ТекущаяИерархия",ЭтаФорма.ТекущаяИерархия));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Справочник_НоменклатураВыдачи_ФормаВыбора","ФормаВыбора");
	
	Если Настройки <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(Настройки.ТекущаяИерархия) Тогда
			
			Если Не (Настройки.ТекущаяИерархия.ПолучитьОбъект() = Неопределено) Тогда
				ЭтаФорма.Элементы.Иерархия.ТекущаяСтрока = Настройки.ТекущаяИерархия;
				ЭтаФорма.ТекущаяИерархия = Настройки.ТекущаяИерархия;
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
	
	//отбор при заполнении комплектующих
	Если ЗначениеЗаполнено(Параметры.СписокНоменклатуры) Тогда
		Если Параметры.ПодлежитУтилизации Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Ссылка", Параметры.СписокНоменклатуры,ВидСравненияКомпоновкиДанных.ВСписке, "Ссылка", Истина);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Ссылка", Параметры.СписокНоменклатуры,ВидСравненияКомпоновкиДанных.НеВСписке, "Ссылка", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Комплект", Ложь,ВидСравненияКомпоновкиДанных.Равно, "Комплект", Истина);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Ссылка", Параметры.СписокНоменклатуры,ВидСравненияКомпоновкиДанных.НеВСписке, "Ссылка", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Комплект", Ложь,ВидСравненияКомпоновкиДанных.Равно, "Комплект", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	
	
КонецПроцедуры
